## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.peering.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-hub-vnet-to-aztf-spoke-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "aztf-hub-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-hub-vnet"
    }

  # module.peering.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "aztf-spoke-vnet-to-aztf-hub-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet"
      + resource_group_name                    = "aztf-spoke-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_network_security_group.nsgs["akssubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "akssubnet-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_resource_group.spoke_rg will be created
  + resource "azurerm_resource_group" "spoke_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-spoke-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_route_table.route_tables["akssubnet"] will be created
  + resource "azurerm_route_table" "route_tables" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "aztf-spoke-rt"
      + resource_group_name           = "aztf-spoke-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "route_to_firewall"
              + next_hop_in_ip_address = "10.0.1.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["akssubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.16.0/20",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "akssubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet.spoke_subnets["appgwsubnet"] will be created
  + resource "azurerm_subnet" "spoke_subnets" {
      + address_prefixes                              = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "appgwsubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-spoke-rg"
      + virtual_network_name                          = "aztf-spoke-vnet"
    }

  # module.spoke_networking.azurerm_subnet_network_security_group_association.nsg_associations["akssubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke_networking.azurerm_subnet_route_table_association.rt_associations["akssubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke_networking.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet"
      + resource_group_name = "aztf-spoke-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>